01_cases/vrfb_elec_tailor_ft_h_f_test/system/topoSetDict2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // TAILORING
    {
        name    holeCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
                box (0.0343 0.00145 -0.003) (0.0346 0.00154 0.006);
        }
    }
    
    {
        name    holeCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        sourceInfo
        {
            box (0.00187 0.00145 -0.003)     (0.0021  0.00154 0.006);
        }
    }
    
    {
        name    holes;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set holeCellSet;
        }
    }

 
);


// ************************************************************************* //
